## Introducing to Data Cleaning

Data extracted from the real world contains incorrect, incomplete, irrelevant or
missing values which need to be cleaned.

Cleaning can be done by modifying, replacing or deleting such values.

Data cleaning is a fundamental part of Data Science lifecycle.

### Quality of Data

Today's world is all about data-driven decision making, hence the quality of our
data will ultimately impact the quality of the decision that we make based on
that data.

Data is generally considered high quality if it is "fit for [its] intended uses
in operations, decision making and planning".

Through different data cleaning techniques, we can improve the quality of our
data extracted from the real world.

### Examples of Anomalies

An anomaly in data, also know as an outlier, is the observation which differs
significantly from the standard pattern (the rest of the data).

Anomalies in data could arise for a number of reasons, such as human error.

Consider the given series containing width of a table measured by 5 different
students:
- The 3rd value is significantly different than the rest - an anomaly

In [3]:
import pandas as pd

x = pd.Series([2.1, 2.3, 4.5, 2.2, 2.4])
display(x)
display(type(x))

0    2.1
1    2.3
2    4.5
3    2.2
4    2.4
dtype: float64

pandas.core.series.Series

- Data extracted from real world often contains such anomalies
  - Temperature data over a period of 6 months might contain some irregular
    values due to tremendous shifts in weather conditions
- It is important to detect such anomalies in the data and deal with then appropriately
- ![alt text](../img/06-DataAnomalies.png)

### Median-based Anomaly Detection

- One way to detect anomalies is using the median value
- We set a reasonable threshold and if for a certain value, | value - median | >
  threshold, then the value is considered an anomaly

In [5]:
import numpy as np

median = np.median(x)
threshold = 2
outliers = []

for item in x:
    if abs(item - median) > threshold:
        outliers.append(item)

display(outliers)

[4.5]

#### Quiz

A certain dataset has a median value 3, and the threshold for anomaly detection
is 2. Third value of the dataset is 7. According to the median-based anomaly
detection, is the value an anomaly?
- Yes, 7 minus 3 is 4, which is greater than the threshold.

### Mean-based Anomaly Detection

- Another way to detect anomalies is using mean and standard deviation of the data
- We define the range as (mean - standard deviation) <= value <= (mean + standard deviation)
  - i.e., any value less than (mean - standard deviation) or greater than (mean
    + standard deviation) is considered an anomaly

In [7]:
mean = np.mean(x)
display(mean)

std = np.std(x)
display(std)

outliers = []

for item in x:
    if (item < mean - std) or (item > mean + std):
        outliers.append(item)

display(outliers)

2.7

0.9055385138137416

[4.5]

Sometimes you might want to define the lowerbound as mean minus two times standard deviationand the upper bound as mean plus two times standard deviation or even bigger.

#### Quiz

A certain dataset has a mean value 20 and a standard deviation of 2.5. A certain
value x in the dataset is 16. According to mean-based anomaly detection, is x an
anomaly?
- Yes, the value is 16 is less than the lower bound 17.5

### Z-score-based Anomaly Detection

- Another technique for anomaly detection is Z-score
- Z-score is a statistical measure showing how many standard deviations a
  certain value is from the mean
- It is defined as:
  - Z = (value - mean) / standard deviation
- If the Z-score of a value ir greater than a reasonable threshold, it is
  considered an anomaly

In [8]:
mean = np.mean(x)
display(mean)

std = np.std(x)
display(std)

outliers = []

threshold = 1.5

for item in x:
    z_score = (item - mean) / std
    if z_score > threshold:
        outliers.append(item)

display(outliers)

2.7

0.9055385138137416

[4.5]

#### Quiz

A certain dataset has a mean value of 12 and a standard deviation of 2. A
certain value X in the dataset is 8, compute the Z-score of the value X.
- The correct answer is 2.

### Interquartile Range for Anomaly Detection

#### IQR

- We can also use interquartile range (IQR) for detecting anomalies in the data
- A quartile divides the dataset (sorted from smallest to largest) into 3 points
  and 4 intervals
- The first quartile is at 25%.The second, at 50% of the median and the third quartile is at 75.
- The interquartile range (IQR) is the diference between the 3rd quartile and
  1st quartile (IQR = Q3 - Q1)
  ![alt text](../img/06-InterquartileAnomaliesDetection.png)
- The difference between the third and the first quartile is called the interquartile range and is an effective metric to detect anomaly in the data.

- Consider the given list of weights. In order to compute the quartiles, we
  first need to sort the data from smallest to largest value. Which is the
  second list that you see on the screen.

In [9]:
widths = pd.Series([2.3, 2.2, 4.5, 2.1, 2.5])
widths

0    2.3
1    2.2
2    4.5
3    2.1
4    2.5
dtype: float64

In [11]:
widthsSorted = widths.sort_values().reset_index(drop=True)
widthsSorted

0    2.1
1    2.2
2    2.3
3    2.5
4    4.5
dtype: float64

- The first quartile also known as Q1 is the value at 25% of the data. Which is
  2.2.
- The second quartile also known as Q2 is the value at 50% of the data,
  which also happens to be the median of the dataset. In this case, Q2 is 2.3
- The third quartile or Q3 is the value at 75%, which is in this case is 2.5
- The interquartile range is the difference between Q3 and Q1
- We can compute quartiles in Python using the `numpy.percentile()` function
  available inside the NumPy library
  - It sorts the data automatically before computing the quartiles
  - Any value in the data that is less than (Q1 - 1.5 *  IQR) or bigger than (Q3 + 1.5 *IQR) is regarded as anomaly.

In [15]:
display(widths)

Q1, Q3 = np.percentile(widths, [25, 75])
display(Q1)
display(Q3)

IQR = Q3 - Q1
display(IQR)

outliers = []

threshold = 1.5

for item in widths:
    if item < (Q1 - threshold * IQR) or item > (Q3 + threshold * IQR):
        outliers.append(item)

display(outliers)

0    2.3
1    2.2
2    4.5
3    2.1
4    2.5
dtype: float64

2.2

2.5

0.2999999999999998

[4.5]

In all the methods for anomaly detection, we got the same result. However, this is not always the case

#### Quiz

Remember that first quartile is the value of 25% of the dataset. Second quartile
is the median value and the third quartile is the value at 75% of the
dataset.

Consider the given dataset x=[1, 2, 3, 4, 5]. What is the second quartile (Q2)
of the dataset?
- 3

Compute the interquartile range for the dataset x=[1, 2, 3, 4, 5]:
- 2

### Dealing with Missing values

- Apart from outliers/anomalies, data also often contains missing values
- A missing value means a loss of information
- In Pandas, an NaN indicates a missing value

Consider the following dataframe called data with one missing value in the
**Age** column:

In [20]:
data = pd.DataFrame({'Name': ['Edison', 'Edward', 'James', 'Neesham'], 'Age': [28, 27, np.nan, 36]})

data

      Name   Age
0   Edison  28.0
1   Edward  27.0
2    James   NaN
3  Neesham  36.0

#### Finding Missing Values in Pandas

- The `.isnull()` function tells us if a cell is empty or not
- Use the `.sum()` function with the `.isnull()` function to find total number
  of missing values in the data

In [21]:
display(data.isnull())
display(data.isnull().sum())

    Name    Age
0  False  False
1  False  False
2  False   True
3  False  False

Name    0
Age     1
dtype: int64

- There are a number of ways to deal with these missing values
- Which method to use depends upon the kind of data and the task that the data
  is supposed to accomplish
- Different methods are:
  - Deleting rows with missing values (can cause a significant lost of information)
  - Replacing missing values with mean/median/mode (can be a better option for
    some cases)

- One way to deal with the missing values is to delete the rows containing
  missing values
- Use the `.dropna()` with inplace set to `True` to remove missing values from
  the dataset

In [24]:
data.dropna(inplace=True)
data

      Name   Age
0   Edison  28.0
1   Edward  27.0
3  Neesham  36.0

- We can also replace the missing values in each column with one of the
  statistical measures (mean/median/mode) of that column

In [34]:
from numpy import NaN

data1 = {'Name': ['Edison', 'Edward', 'James', 'Neesham'], 'Age': [28, 27, NaN, 36]}
data = pd.DataFrame.from_dict(data1)
display(data)

mean = data['Age'].mean()
display(mean)

data.fillna(mean, inplace=True) # Fills NaN values in all columns

data

      Name   Age
0   Edison  28.0
1   Edward  27.0
2    James   NaN
3  Neesham  36.0

30.333333333333332

      Name        Age
0   Edison  28.000000
1   Edward  27.000000
2    James  30.333333
3  Neesham  36.000000

- In the following example, we replace the missing value in the **Age** column with
  the mode of the **Age** column. Mode is the value that appears most often

In [35]:
data = pd.DataFrame({'Name': ['Edison', 'Edward', 'James', 'Neesham'], 'Age': [28, 27, np.nan, 36]})
display(data)

mode = data['Age'].mode()
display(mode)

data['Age'].fillna(mode[0], inplace=True)
display(data)

      Name   Age
0   Edison  28.0
1   Edward  27.0
2    James   NaN
3  Neesham  36.0

0    27.0
1    28.0
2    36.0
Name: Age, dtype: float64

C:\Users\FIA\AppData\Local\Temp\ipykernel_34804\3212948835.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Age'].fillna(mode[0], inplace=True)

      Name   Age
0   Edison  28.0
1   Edward  27.0
2    James  27.0
3  Neesham  36.0

### Regular Expressions

- Regular Expressions or RegEx is an expression containing a sequence of
  characters for matching patterns in strings
- Almost all the major programming languages have a implementation for RegEx
- The `re` module of Python is used for pattern matching using RegEx in Python
- Following functions are available in the RegEx module:
  - `findall()`
  - `search()`
  - `sub()`

#### re.findall()

- Used to match all the occurrences of a pattern in a string
- A List with all the matches is returned
- In the given example, we find how many times does the word "Python" appear in
  the given string

In [36]:
import re

txt = 'Python is a good programming language. Is nice to use Python'
x = re.findall('Python', txt)
display(x)
display(len(x))

['Python', 'Python']

2

- In the given example, we check if the string "x" starts with the word "Python"
  or not
- The `^` character returns a match only if the string starts with the pattern
  given after the `^` symbol
- The string "y" contains the word "Python", but doesn't begin with it, hence we
  get an empty List

In [39]:
x = 'Python is a good programming language.'
y = 'Is nice to use Python'

display(re.findall('^Python', x))
display(re.findall('^Python', y))

['Python']

[]

- To match numbers in a string, we use the `\d` sequence
- A `+` sign at the end of a `\d`, makes sure that number such as 50 is treated
  as 50 and not as a 5 and a 0
- You can find a list of sequences at https://www.w3schools.com/python/python_regex.asp

In [40]:
txt = 'Python was released in 1991'

display(re.findall('\d', txt))
display(re.findall('\d+', txt)) # Using '\d+' to match more than one sequential occurrence

<>:3: SyntaxWarning: invalid escape sequence '\d'
<>:4: SyntaxWarning: invalid escape sequence '\d'
<>:3: SyntaxWarning: invalid escape sequence '\d'
<>:4: SyntaxWarning: invalid escape sequence '\d'
C:\Users\FIA\AppData\Local\Temp\ipykernel_34804\1498139143.py:3: SyntaxWarning: invalid escape sequence '\d'
  display(re.findall('\d', txt))
C:\Users\FIA\AppData\Local\Temp\ipykernel_34804\1498139143.py:4: SyntaxWarning: invalid escape sequence '\d'
  display(re.findall('\d+', txt))

['1', '9', '9', '1']

['1991']

- To find matches in a Series, we first convert the Series into a string using
  the `.to_string()` function

In [42]:
txtList = ['Brasil', 'Argentina', 'Espanha', 'Italia', 'Brasil']
txt = pd.Series(txtList)

display(txt)

display(re.findall('Brasil', txt.to_string()))
display(len(re.findall('Brasil', txt.to_string())))

0       Brasil
1    Argentina
2      Espanha
3       Italia
4       Brasil
dtype: object

['Brasil', 'Brasil']

2

#### re.search()

- `re.search()` returns a Match Object in case of a pattern match in the string
- We can get the position of the match using the `.span()` method of the Match Object

In [43]:
txt = 'Hello World'

match_object = re.search('World', txt)
match_object

In [44]:
match_object.span()

(6, 11)

#### re.sub()

- Used to replace text in a string with a different text

In [45]:
txt = 'C is a good programming language'
re.sub(pattern='C', repl='Python', string=txt)

'Python is a good programming language'

- https://regex101.com is a very good website to create and test regular expressions

### Feature Scaling

- Sometimes, we might wish to normalize the range of each feature (column) of
  the given dataset
- For example, consider the given DataFrame where the range of each feature
  (column) is different
- We would like to scale all the features to the same range, e.g. 0-1, 1-100, etc...

In [46]:
df = pd.DataFrame({'Age': [28.0, 27.0, 30.0, 36.0, 27.0], 'Salary': [10000, 15000, 11000, 11000, 13000]})
df

    Age  Salary
0  28.0   10000
1  27.0   15000
2  30.0   11000
3  36.0   11000
4  27.0   13000

#### Normalization

- One simple method of feature scaling is normalization, also called min-max scaling
- For every value in the feature (column), we subtract the minimum value of the
  particular feature (column) from it and divide it by the difference of maximum
  and minimum value of the feature (column)
  - Normalized value = (original value - minimum)/(maximum - minimum)
- This method scales the features in the range [0-1]

- For min-max scaling, use the following line of code:
  - normalized_df = (df - df.min()) / (df.max() - df.min())
- Pandas will automatically use the feature (column) min-max values for each feature

In [47]:
normalized_df = (df - df.min()) / (df.max() - df.min())
normalized_df

        Age  Salary
0  0.111111     0.0
1  0.000000     1.0
2  0.333333     0.2
3  1.000000     0.2
4  0.000000     0.6

#### Standardization

- In standardization, for each value of a feature (column), we subtract the mean
  of that feature (column) from the value and divide the result by the standard
  deviation of that feature (column)
  - standardazed value = (original value - mean) / standard deviation
- As result, the standard deviation of the feature (column) becames 1
- Once again, Pandas will automatically use the feature (column) mean and std for each feature

In [49]:
standardazed_df = (df - df.mean()) / df.std()
standardazed_df

        Age  Salary
0 -0.423109    -1.0
1 -0.687552     1.5
2  0.105777    -0.5
3  1.692435    -0.5
4 -0.687552     0.5

In [51]:
standardazed_df.std()

Age       1.0
Salary    1.0
dtype: float64